In [56]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data cleaning
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [ ]:

df['salary_year_avg'][df['salary_year_avg'].notna()]
df['job_skills'][df['job_skills'].isna()]

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

In [20]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

# Calculate Project Salary Next Year

In [23]:
# using the apply function with a calculated function
df_salary = df[df['salary_year_avg'].notna()].copy()

def projected_salary(salary):
    return salary * 1.03

df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(projected_salary)

df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [ ]:
# using the apply function with an anonymous function like lambda

df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary * 1.03)

df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [ ]:
# simple method without apply function
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'] * 1.03

df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [57]:
df['job_skills'][1]

"['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']"

In [58]:
import ast

ast.literal_eval(df['job_skills'][1])

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [45]:
# to apply the ast.literal_eval function to the entire job skills column
def clean_list(skill_list):
    if pd.notna(skill_list):
        return ast.literal_eval(skill_list)

df['job_skills'] = df['job_skills'].apply(clean_list)

In [ ]:
# to confirm it worked
df['job_skills'][1]

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [ ]:
# df[pd.isna(df['job_skills'])] # or df[df['job_skills'].isna()]

In [ ]:
# doing the same with a lambda function
df['job_skills'] = df['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)

In [60]:
df['job_skills'][1]

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

# Calculate projected salary next year
- Senior roles assume 5%
- other roles assume 3%

In [ ]:
# using the applying function on rows 
def projected_salary(row):
    if 'Senior' in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
    else:
        return 1.03 * row['salary_year_avg']


df_salary['salary_year_inflated'] = df_salary.apply(projected_salary, axis=1)

df_salary.iloc[200:250][['job_title_short', 'salary_year_avg', 'salary_year_inflated']]

                job_title_short  salary_year_avg  salary_year_inflated
5554           Business Analyst          64600.0             66538.000
5579      Senior Data Scientist         170000.0            178500.000
5580              Data Engineer         200000.0            206000.000
5628             Data Scientist         361000.0            371830.000
5658       Senior Data Engineer         200000.0            210000.000
5684              Data Engineer         125000.0            128750.000
5688      Senior Data Scientist         180000.0            189000.000
5703               Data Analyst          65000.0             66950.000
5709             Data Scientist         192000.0            197760.000
5795              Data Engineer         100000.0            103000.000
5809              Data Engineer         125000.0            128750.000
5829              Data Engineer         100000.0            103000.000
5839               Data Analyst          67500.0             69525.000
5862  Machine Learning Engineer         325000.0            334750.000
5887              Data Engineer         122500.0            126175.000
5946              Data Engineer         136000.0            140080.000
5949             Data Scientist         160000.0            164800.000
6046             Data Scientist         115000.0            118450.000
6233              Data Engineer         150000.0            154500.000
6263              Data Engineer         165000.0            169950.000
6305             Data Scientist         170000.0            175100.000
6325              Data Engineer         147500.0            151925.000
6350             Data Scientist         250000.0            257500.000
6382              Data Engineer         110000.0            113300.000
6431              Data Engineer          96760.5             99663.315
6442              Data Engineer         137500.0            141625.000
6471              Data Engineer         132000.0            135960.000
6496      Senior Data Scientist         129000.0            135450.000
6500              Data Engineer         144820.0            149164.600
6525           Business Analyst          63000.0             64890.000
6567               Data Analyst          56700.0             58401.000
6575             Data Scientist         176273.5            181561.705
6615              Data Engineer         100000.0            103000.000
6707  Machine Learning Engineer          56700.0             58401.000
6748           Business Analyst         105000.0            108150.000
6755             Data Scientist          90000.0             92700.000
6825        Senior Data Analyst          84039.0             88240.950
6828             Data Scientist         110000.0            113300.000
6880             Data Scientist         234000.0            241020.000
6895       Senior Data Engineer         185000.0            194250.000
6941              Data Engineer         147500.0            151925.000
7001               Data Analyst         134984.0            139033.520
7006       Senior Data Engineer         136500.0            143325.000
7081               Data Analyst          76007.0             78287.210
7090              Data Engineer         284016.0            292536.480
7092             Data Scientist         285500.0            294065.000
7095             Data Scientist         123750.0            127462.500
7118             Data Scientist         167500.0            172525.000
7140       Senior Data Engineer         124500.0            130725.000
7170       Senior Data Engineer          89100.0             93555.000

In [ ]:
# using the apply function with an anonymous function like lambda on rows

df_salary['salary_year_inflated'] = df_salary.apply(lambda row: 1.05 * row['salary_year_avg'] if 'Senior' in row['job_title_short'] else 1.03 * row['salary_year_avg'], axis=1)

df_salary.iloc[200:250]

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,salary_year_inflated
5554,Business Analyst,Associate Business Intelligence Analyst,Canada,via Ai-Jobs.net,Full-time,False,Canada,2023-10-31 13:37:08,False,False,Canada,year,64600.0,NaN,Manulife,"['sql', 'power bi']","{'analyst_tools': ['power bi'], 'programming':...",66538.000
5579,Senior Data Scientist,Senior Data Scientist,United States,via LinkedIn,Full-time,False,"Illinois, United States",2023-05-03 13:05:09,False,False,United States,year,170000.0,NaN,Harnham,"['python', 'sql']","{'programming': ['python', 'sql']}",178500.000
5580,Data Engineer,Data Engineer,"New York, NY",via Dice,Full-time,False,"Texas, United States",2023-09-29 13:07:23,False,False,United States,year,200000.0,NaN,Jobot,"['python', 'sql', 'mongodb', 'mongodb', 'spark...","{'databases': ['mongodb'], 'libraries': ['spar...",206000.000
5628,Data Scientist,"Data Scientist Lead, Global Monetization Strat...","San Jose, CA",via LinkedIn,Full-time,False,"California, United States",2023-11-29 13:04:38,False,True,United States,year,361000.0,NaN,TikTok,"['r', 'python', 'sql']","{'programming': ['r', 'python', 'sql']}",371830.000
5658,Senior Data Engineer,Senior Data Engineer,"Toronto, ON, Canada",via Ladders,Full-time,False,Canada,2023-08-14 13:10:47,True,False,Canada,year,200000.0,NaN,Mercury,"['snowflake', 'react']","{'cloud': ['snowflake'], 'libraries': ['react']}",210000.000
5684,Data Engineer,Lead Data Engineer,"Charlotte, NC",via BeBee,Full-time,False,"California, United States",2023-12-16 13:04:22,False,True,United States,year,125000.0,NaN,LTI - Larsen & Toubro Infotech,"['sql', 'snowflake', 'aws', 'tableau']","{'analyst_tools': ['tableau'], 'cloud': ['snow...",128750.000
5688,Senior Data Scientist,Senior Data Scientist,"San Diego, CA",via Central Illinois Proud Jobs,Full-time,False,"California, United States",2023-01-04 13:03:59,False,False,United States,year,180000.0,NaN,Harnham,"['python', 'sql', 'aws', 'tensorflow', 'spark'...","{'cloud': ['aws'], 'libraries': ['tensorflow',...",189000.000
5703,Data Analyst,Healthcare Data Analyst,"Dallas, TX",via Dice,Full-time,False,"Texas, United States",2023-10-31 13:01:13,False,False,United States,year,65000.0,NaN,"Citron IT, Inc.","['sql', 'python', 'r', 'azure', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'cl...",66950.000
5709,Data Scientist,"Data Scientist, Product Analytics (Multiple Op...","San Jose, CA",via LinkedIn,Full-time,False,"California, United States",2023-12-29 13:00:33,False,True,United States,year,192000.0,NaN,TikTok,"['python', 'r', 'sql']","{'programming': ['python', 'r', 'sql']}",197760.000
5795,Data Engineer,Higher Education Data Engineer,"Tempe, AZ",via Get.It,Full-time,False,"New York, United States",2023-08-29 13:25:09,False,True,United States,year,100000.0,NaN,Get It Recruit - Educational Services,"['python', 'java', 'r', 'spark', 'tensorflow',...","{'analyst_tools': ['excel', 'power bi'], 'libr...",103000.000
5809,Data Engineer,Data Engineer,"Atlanta, GA",via Ladders,Full-time,False,"New York, United States",2023-04-05 13:05:27,False,False,United States,year,125000.0,NaN,HD Supply Holdings,['flow'],{'other': ['flow']},128750.000
5829,Data Engineer,Data Engineer,"Indianapolis, IN",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:07:49,True,True,United States,year,100000.0,NaN,"Pinnacle Partners, Inc","['sql', 'sql server']","{'databases': ['sql server'], 'programming': [...",103000.000
5839,Data Analyst,Data Analyst,"New York, NY",via Adzuna,Full-time,False,"New York, United States",2023-02-13 12:59:57,False,False,United States,year,67500.0,NaN,Universal,"['python', 'excel', 'tableau']","{'analyst_tools': ['excel', 'tableau'], 'progr...",69525.000
5862,Machine Learning Engineer,Principal Machine Learning Engineer,Anywhere,via LinkedIn,Full-time,True,Sudan,2023-11-24 14:22:22,False,False,Sudan,year,325000.0,NaN,Storm5,"['python', 'java', 'sql', 'aws', 'gcp', 'airfl...","{'cloud': ['aws', 'gcp'], 'libraries': ['airfl...",334750.000
5887,Data Engineer,DBA/Data Engineer,"Troy, MI",via Indeed,Full-time,False,"Illinois, United States",2023-03-27 13:15:30,False,False,United States,year,122500.0,NaN,NuTechs LLC,"['sql', 'python', 'sql server', 'dynamodb', 'n...","{'async': ['jira'], 'cloud': ['aws', 'aurora',...",126175.000
5946,Data Engineer,Data Quality Engineer,"Milford, CT",via ZipRecruiter,Full-time,False,"California, United States",2023-12-22 13:03:58,False,False,United States,year,136000.0,NaN,Company Confidential,"['sql', 'snowflake', 'power bi']","{'analyst_tools': ['power bi'], 'cloud': ['sno...",140080.000
5949,Data Scientist,Government Intelligence Data Scientist / Analy...,"Washington, DC",via LinkedIn,Full-time,False,Georgia,2023-07-31 14:22:56,False,False,United States,year,160000.0,NaN,"Specialized Recruiting Group - Charlotte, NC","['sql', 'python', 'excel', 'tableau']","{'analyst_tools': ['excel', 'tableau'], 'progr...",164800.000
6046,Data Scientist,Data Scientist,"Pittsburgh, PA",via LinkedIn,Full-time,False,"New York, United States",2023-03-22 13:09:50,False,True,United States,year,115000.0,NaN,Lawrence Harvey,"['python', 'r', 'pytorch', 'tensorflow', 'keras']","{'libraries': ['pytorch', 'tensorflow', 'keras...",118450.000
6233,Data Engineer,Sr. Data Engineer,Anywhere,via Indeed,Full-time,True,"New York, United States",2023-06-17 13:05:22,False,True,United States,year,150000.0,NaN,CyberCoders,"['sql', 'python', 'aws', 'redshift', 'airflow'...","{'cloud': ['aws', 'redshift'], 'libraries': ['...",154500.000
6263,Data Engineer,Senior Staff Data Engineer,"Sunnyvale, CA",via Ladders,Full-time,False,"Florida, United States",2023-08-03 13:10:10,False,True,United States,year,165000.0,NaN,Danaher,"['sql', 'sql server', 'postgresql', 'dynamodb'...","{'cloud': ['aws', 'azure', 'redshift'], 'datab...",169950.000
6305,Data Scientist,Data Science Manager,Georgia,via LinkedIn,Full-time,False,"Florida, United States",2023-08-24 13:07:46,False,True,United States,year,170000.0,NaN,"Evolution Recruitment Solutions, USA","['python', 'sql', 'aws', 'tableau', 'excel']","{'analyst_tools': ['tableau', 'excel'], 'cloud...",175100.000
6325,Data Engineer,Data Engineer (Chile) Sb4375,"Santiago, Chile",via Ai-Jobs.net,Full-time,False,Chile,2023-01-16 14:08:30,False,False,Chile,year,147500.0,NaN,Nisum,"['python', 'mongo', 'gcp', 'databricks', 'kafk...","{'analyst_tools': ['power bi'], 'cloud': ['gcp...",151925.000
6350,Data Scientist,Data Scientist,"Los Angeles, CA",via IT JobServe,Full-time,False,"California, United States",2023-01-22 13:04:10,False,False,United States,year,250000.0,NaN,INgroovesMusicGroup,"['python', 'r', 'julia', 'sql', 'aws', 'redshi...","{'cloud': ['aws', 'redshift'], 'libraries': ['...",257500.000
6382,Data Engineer,Data Engineer,California,via LinkedIn,Full-time,False,Sudan,2023-01-31 14:36:12,False,False,Sudan,year,110000.0,NaN,Northbound Executive Search,"['python', 'java', 'sql', 'azure', 'snowflake'...","{'cloud': ['azure', 'snowflake', 'databricks']...",113300.000
6431,Data Engineer,Data Engineer,"Bangkok, Thailand",via Ai-Jobs.net,Full-time,False,Thailand,2023-01-05 13:36:12,True,False,Thailand,year,96760.5,NaN,Data Wow,"['python', 'sql', 'aws', 'flask', 'django', 'f...","{'cloud': ['aws'], 'os': ['windows'], 'other':...",99663.315
6442,Data Engineer,Azure Data Engineer. Job in Dallas My Valley J...,"Dallas, TX",via My Valley Jobs Today,Full-time,False,"Florida, United States",2023-10-22 13:24:22,True,False,United States,year,137500.0,NaN,Jobot,"['sql', 'python', 'scala', 'azure']","{'cloud': ['azure'], 'programming': ['sql', 'p...",141625.000
6471,Data Engineer,Data Engineer,Anywhere,via ZipRecruiter,Full-time,True,"Illinois, United States",2023-06-23 13:27:10,False,False,United States,year,132000.0,NaN,DealNews,"['sql', 'tableau', 'alteryx']","{'analyst_tools': ['tableau', 'alteryx'], 'pro...",135960.000
6496,Senior Data Scientist,Sr Data Scientist - Recommendations (Applied M...,"Minneapolis, MN",via My ArkLaMiss Jobs,Full-time,False,"Illinois, United States",2023-07-17 13:08:22,False,True,United States,year,129000.0,NaN,Target,"['python', 'scala', 'sql', 'spark']","{'libraries': ['spark'], 'programming': ['pyth...",135450.000
6500,Data Engineer,"Data Engineer (Colorado Springs, CO)","Colorado Springs, CO",via Built In Colorado,Full-time,False,Georgia,2023-04-25 13:41:08,False,True,United States,year,144820.0,NaN,Torch Technologies,"['sql', 'python', 'airflow']","{'libraries': ['airflow'], 'programming': ['sq...",149164.600
6525,Business Analyst,Bi Analyst,"Amsterdam, Netherlands",via Ai-Jobs.net,Full-time,False,Netherlands,2023-01-25 14:04:04,False,False,Netherlands,year,63000.0,NaN,OpenUp,"['sql', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ...",64890.000
6567,Data Analyst,Data Analytics Assistant,"Warsaw, Poland",via Ai-Jobs.net,Full-time,False,Poland,2023-04-25 13:25:00,True,False,Poland,year,56700.0,NaN,Publicis Groupe,"['r', 'python', 'spark', 'tidyverse', 'pandas'...","{'libraries': ['spark', 'tidyverse', 'pandas',...",58401.000
6575,Data Scientist,Lead Data Scientist,"Minneapolis, MN",via My Stateline Jobs,Full-time,False,"Illinois, United States",2023-08-21 13:07:04,False,True,United States,year,176273.5,NaN,Target,"['sql', 'r', 'python', 'c', 'javascript', 'sca...","{'analyst_tools': ['sas'], 'libraries': ['spar...",181561.705
6615,Data Engineer,Data Analytics Engineer,"Mehoopany, PA",via Indeed,Full-time,False,"New York, United States",2023-09-18 13:00:29,False,True,United States,year,100000.0,NaN,Procter & Gamble,"['sql', 'r', 'java', 'sql server', 'hadoop', '...","{'analyst_tools': ['tableau', 'power bi', 'sap...",103000.000
6707,Machine Learning Engineer,Stage Machine Learning,"Nantes, France",via Ai-Jobs.net,Full-time,False,France,2023-02-01 13:52:36,False,False,France,year,56700.0,NaN,Talend,"['r', 'python', 'sas', 'sas', 'gdpr', 'git']","{'analyst_tools': ['sas'], 'libraries': ['gdpr...",58401.000
6748,Business Analyst,Sales Analytics Manager,Georgia,via LinkedIn,Full-time,False,Georgia,2023-10-12 14:18:54,False,False,United States,year,105000.0,NaN,Oxenham Group,['outlook'],{'analyst_tools': ['outlook']},108150.000
6755,Data Scientist,Lead Data Science Consultant - Supply Chain,"Cincinnati, OH",via Ladders,Full-time,False,"Illinois, United States",2023-08-11 13:05:11,False,False,United States,year,90000.0,NaN,84.51,"['python', 'r', 'sql', 'excel']","{'analyst_tools': ['excel'], 'programming': ['...",92700.000
6825,Senior Data Analyst,Senior Data Analyst,"Richland, SC",via Indeed,Full-time,False,Georgia,2023-07-10 13:53:02,False,True,United States,year,84039.0,NaN,University of South Carolina,"['sas', 'sas', 'r', 'sql', 'python', 'spss', '...","{'analyst_tools': ['sas', 'spss', 'tableau', '...",88240.950
6828,Data Scientist,Data Scientist,Anywhere,via Indeed,Full-time,True,"Texas, United States",2023-02-24 13:03:45,False,True,United States,year,110000.0,NaN,Global Medical Response,"['sql', 'python', 'r', 'sas', 'sas', 'matlab']","{'analyst_tools': ['sas'], 'programming': ['sq...",113300.000
6880,Data Scientist,Data Science Manager - TikTok Ads,"San Jose, CA",via LinkedIn,Full-time,False,"California, United States",2023-05-27 13:04:35,False,True,United States,year,234000.0,NaN,TikTok,"['r', 'python', 'matlab', 'sql', 'spark']","{'libraries': ['spark'], 'programming': ['r', ...",241020.000
6895,Senior Data Engineer,Senior Data Science Engineer,California,via Central Illinois Proud Jobs,Full-time,False,"California, United States",2023-01-04 13:04:05,False,False,United States,year,185000.0,NaN,Harnham,"['python', 'sql', 'scala', 'aws', 'pyspark']","{'cloud': ['aws'], 'libraries': ['pyspark'], '...",194250.000
6941,Data Engineer,Data Engineer,"Dublin, Ireland",via Ai-Jobs.net,Full-time,False,Ireland,2023-02-16 13:32:24,False,False,Ireland,year,147500.0,NaN,Version 1,"['sql', 't-sql', 'shell', 'python', 'r', 'sql ...","{'analyst_tools': ['ssis', 'power bi', 'dax'],...",151925.000
7001,Data Analyst,Live Streaming Revenue Product Data Analyst- USDS,"Los Angeles, CA",via LinkedIn,Full-time,False,"California, United States",2023-08-31 13:01:21,False,True,United States,year,134984.0,NaN,TikTok,"['sql', 'python', 'r', 'express']","{'programming': ['sql', 'python', 'r'], 'webfr...",139033.520
7006,Senior Data Engineer,Senior Data Engineer,"Annapolis Junction, MD",via Ai-Jobs.net,Full-time,False,"Florida, United States",2023-07-20 13:10:52,False,False,United States,year,136500.0,NaN,Accenture Federal Services,['c'],{'programming': ['c']},143325.000
7081,Data Analyst,Data Analyst,Anywhere,via Get.It,Full-time,True,"Florida, United States",2023-08-03 13:02:41,False,True,United States,year,76007.0,NaN,Get It Recruit - Healthcare,"['sql', 'python', 'r', 'sas', 'sas', 'matplotl...","{'analyst_tools': ['sas', 'tableau', 'power bi...",78287.210
7090,Data Engineer,"Distinguished Engineer, Data Architecture (Rem...",The Bahamas,via WSPA Jobs,Full-time,False,Bahamas,2023-06-05 14:01:15,False,False,Bahamas,year,284016.0,NaN,Capital One,"['python', 'java', 'scala', 'aws']","{'cloud': ['aws'], 'programming': ['python', '...",292536.480
7092,Data Scientist,"Data Scientist, Global Monetization Strategy &...","San Jose, CA",via LinkedIn,Full-time,False,"California, United States",2023-11-29 13:04:38,False,True,United States,year,285500.0,NaN,TikTok,None,None,294065.000
7095,Data Scientist,Biostatistician / Data Scientist,"Temple Hills, MD",via IT JobServe,Full-time,False,Georgia,2023-07-28 13:38:33,False,False,United States,year,123750.0,NaN,Leidos,['r'],{'programming': ['r']},127462.500
7118,Data Scientist,Lead Data Scientist,"Raleigh, NC",via LinkedIn,Full-time,False,"Florida, United States",2023-02-08 13:05:49,False,False,United States,year,167500.0,NaN,Lawrence Harvey,None,None,172525.000
7140,Senior Data Engineer,Senior Data Engineer,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-17 13:10:09,False,True,United States,year,124500.0,NaN,Get It Recruit - Information Technology,"['sql', 'python', 'powershell', 'sql server', ...","{'analyst_tools': ['tableau'], 'cloud': ['data...",130725.000
7170,Senior Data Engineer,Senior Software Engineer (Data Analytics),"Barcelona, Spain",via Ai-Jobs.net,Full-time,False,Spain,2023-07-24 13:27:58,False,False,Spain,year,89100.0,NaN,Aetion,"['java', 'python', 'scala', 'sql', 'r', 'flow']","{'other': ['flow'], 'programming': ['java', 'p...",93555.000